<?php

namespace Database\Factories;

use Illuminate\Database\Eloquent\Factories\Factory;

/**
 * @extends \Illuminate\Database\Eloquent\Factories\Factory<\App\Models\Test>
 */
class TestFactory extends Factory
{
    /**
     * Define the model's default state.
     *
     * @return array<string, mixed>
     */
    public function definition(): array
    {
        return [
            'code' => fake()->numberBetween(10000000, 99999999),
            'name' => fake()->randomElement([
                'Обычный анализ мочи',
                'Полный анализ мочи',
                'Обычный анализ кала',
                'Полный анализ кала',
                'Полный анализ крови',
                'Анализ крови на сахар',
                'Анализ крови на ВИЧ',
                'Полное исследование био-материала'
            ]),
            'refer' => fake()->randomElement([
                json_encode([
                    'Гемоглобин' => 5,
                    'Инфузории' => 2,
                    'Антитела' => 8,
                    'Лимфоциты' => 1.7,
                    'Эретроциты' => 6,
                    'Среднее значение' => 1
                ]),
                json_encode([
                    'Гемоглобин' => 5,
                    'Инфузории' => 2,
                    'Антитела' => 8,
                    'Лимфоциты' => 2.7,
                    'Эретроциты' => 5,
                    'Среднее значение' => 6
                ]),
                json_encode([
                    'Гемоглобин' => 21,
                    'Инфузории' => 2,
                    'Антитела' => 38,
                    'Лимфоциты' => 12.73,
                    'Эретроциты' => 6.51,
                    'Среднее значение' => 45
                ]),
                json_encode([
                    'Гемоглобин' => 15,
                    'Инфузории' => 92,
                    'Антитела' => 38,
                    'Лимфоциты' => 12.2,
                    'Эретроциты' => 6.1,
                    'Среднее значение' => 0.15
                ]),
                json_encode([
                    'Гемоглобин' => 15,
                    'Инфузории' => 12,
                    'Антитела' => 13,
                    'Лимфоциты' => 14.7,
                    'Эретроциты' => 6.5,
                    'Среднее значение' => 5
                ]),
                json_encode([
                    'Гемоглобин' => 51,
                    'Инфузории' => 10,
                    'Антитела' => 11,
                    'Лимфоциты' => 11.7,
                    'Эретроциты' => 0.5,
                    'Среднее значение' => 15
                ]),
                json_encode([
                    'Гемоглобин' => 2,
                    'Инфузории' => 2,
                    'Антитела' => 1,
                    'Лимфоциты' => 1.7,
                    'Эретроциты' => 1.5,
                    'Среднее значение' => 5
                ])
            ])
        ];
    }
}
